// server list
const serverList = [
  [
    "红玉海",
    "神意之地",
    "拉诺西亚",
    "幻影群岛",
    "萌芽池",
    "宇宙和音",
    "沃仙曦染",
    "晨曦王座",
  ],

  [
    "白银乡",
    "白金幻象",
    "神拳痕",
    "潮风亭",
    "旅人栈桥",
    "拂晓之间",
    "龙巢神殿",
    "梦羽宝境",
  ],
  ["紫水栈桥", "延夏", "静语庄园", "摩杜纳", "海猫茶屋", "柔风海湾", "琥珀原"],
  ["水晶塔", "银泪湖", "太阳海岸", "伊修加德", "红茶川"],
];

// data centre list
const dataCentreList = ["陆行鸟", "莫古力", "猫小胖", "豆豆柴"];

// option code
const options = {
  // 陆行鸟
  红玉海: "1167",
  神意之地: "1081",
  拉诺西亚: "1042",
  幻影群岛: "1044",
  萌芽池: "1060",
  宇宙和音: "1173",
  沃仙曦染: "1174",
  晨曦王座: "1175",

  // 莫古力
  白银乡: "1172",
  白金幻象: "1076",
  神拳痕: "1171",
  潮风亭: "1170",
  旅人栈桥: "1113",
  拂晓之间: "1121",
  龙巢神殿: "1166",
  梦羽宝境: "1175",

  // 猫小胖
  紫水栈桥: "1043",
  延夏: "1169",
  静语庄园: "1106",
  摩杜纳: "1045",
  海猫茶屋: "1177",
  柔风海湾: "1178",
  琥珀原: "1179",

  // 豆豆柴
  水晶塔: "1192",
  银泪湖: "1183",
  太阳海岸: "1180",
  伊修加德: "1186",
  红茶川: "1201",
};

var serverTrans = { serverList, dataCentreList };
export default serverTrans;
